# ExtendToOtherWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..ExtendToOtherWarn Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't keep [Type Name] extended to [Type Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExtendToOtherWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtendToOtherWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExtendToOtherWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace